tutorials/Translational/wind/06_wing_listSpring_linearDamping/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-1.2 -2.2 -0.1)
    ( 5   -2.2 -0.1)
    ( 5    2.2 -0.1)
    (-1.2  2.2 -0.1)
    (-1.2 -2.2  0.1)
    ( 5   -2.2  0.1)
    ( 5    2.2  0.1)
    (-1.2  2.2  0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (36 24 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    topAndBottom
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
        );
    }

    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }

    symFront
    {
        type symmetryPlane;
        faces
        (
            (4 5 6 7)
        );
    }

    symBack
    {
        type symmetryPlane;
        faces
        (
            (0 3 2 1)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
